---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.Alignment.Element
zh: 构件、图元、元素
source: html/5bbd827f-37de-bfd5-de3f-ecac0179eb3b.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.Element Property

**中文**: 构件、图元、元素

The underlying DirectShape element.

## Syntax (C#)
```csharp
public Element Element { get; }
```